<a href="https://colab.research.google.com/github/Andrade-Douglas/Data-Science/blob/master/vinte_pessoas_ricas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **As 20 pessoas mais ricas do planeta**
url: https://www.infomoney.com

data: [clique aqui](https://www.infomoney.com.br/carreira/gestao-e-lideranca/noticia/7968899/as-20-pessoas-mais-ricas-do-mundo-segundo-a-forbes-)

In [1]:
import pandas as pd
import numpy as np
import plotly.offline as py
import plotly.graph_objs as go
py.init_notebook_mode(connected=True)

In [0]:
import requests
from bs4 import BeautifulSoup

In [3]:
# realizando chamada do site

response = requests.get('https://www.infomoney.com.br/carreira/gestao-e-lideranca/noticia/7968899/as-20-pessoas-mais-ricas-do-mundo-segundo-a-forbes-')
print(response.text[0:500])

<!doctype html>
<html lang="pt-BR">
<head>
    <meta charset="UTF-8"><script type="text/javascript">window.NREUM||(NREUM={}),__nr_require=function(e,n,t){function r(t){if(!n[t]){var o=n[t]={exports:{}};e[t][0].call(o.exports,function(n){var o=e[t][1][n];return r(o||n)},o,o.exports)}return n[t].exports}if("function"==typeof __nr_require)return __nr_require;for(var o=0;o<t.length;o++)r(t[o]);return r}({1:[function(e,n,t){function r(){}function o(e,n,t){return function(){return i(e,[c.now()].concat

In [0]:
# atribuindo conteúdo para uma variável

soup = BeautifulSoup(response.text,'html.parser')

In [0]:
# interagindo com todas as <table> do projeto

all_table = soup.find_all('table')

In [0]:
# interagindo apenas com a parte significativa do projeto <table>

table = soup.find('table', {'style':'border-collapse: collapse;width: 96.8295%;height: 928px'})

In [27]:
# entendendo quantos elementos <td> temos

results = soup.find_all('td')
print('Quantidade de elemento <td> existente na árvore: {0} unidades.' .format(len(results)))

Quantidade de elemento <td> existente na árvore: 42 unidades.

In [28]:
# entendendo a estrutura da combinação dos elementos <td>

results[0:4]

[<td style="width: 41.4021%;height: 41px"><strong>Nome </strong></td>,
 <td style="width: 33.5979%;height: 41px"><strong>Patrimônio </strong></td>,
 <td style="width: 41.4021%;height: 40px">1. Jeff Bezos, dono da Amazon</td>,
 <td style="width: 33.5979%;height: 40px">US$ 131 bilhões </td>]

In [29]:
# buscando todos o elementos <tr>

table.findAll('tr')[:2]

[<tr style="height: 41px"><td style="width: 41.4021%;height: 41px"><strong>Nome </strong></td><td style="width: 33.5979%;height: 41px"><strong>Patrimônio </strong></td></tr>,
 <tr style="height: 40px"><td style="width: 41.4021%;height: 40px">1. Jeff Bezos, dono da Amazon</td><td style="width: 33.5979%;height: 40px">US$ 131 bilhões </td></tr>]

In [0]:
# inserindo o conteúdo do site dentro das listas: nome e patrimonio

nome = []
patrimonio = []

for row in table.findAll('tr'):
    cells=row.findAll('td')
    if len(cells)==2:
        nome.append(cells[0].find(text=True))
        patrimonio.append(cells[1].find(text=True))

In [31]:
# transformando em DataFrame os conteúdos das listas

import pandas as pd
df=pd.DataFrame(nome,columns=['name'])
df['patrimony']=patrimonio
df[:5]

                                                name          patrimony
0                                              Nome         Patrimônio
1                      1. Jeff Bezos, dono da Amazon   US$ 131 bilhões
2                  2. Bill Gates, dono da Microsoft   US$ 96,5 bilhões
3                     3. Warren Buffett, investidor   US$ 82,5 bilhões
4  4. Bernard Arnault, presidente do grupo LVMH (...    US$ 76 bilhões

In [32]:
# a coluna name possui informações como nome e ocupação. 
# Logo, usando a virgula iremos separá-las em duas colunas: name e employment

divisao = df['name'].str.split(',')
df['name'] = divisao.str.get(0)
df['employment'] = divisao.str.get(1)
df[:5]

                 name  ...                                         employment
0               Nome   ...                                                NaN
1       1. Jeff Bezos  ...                                     dono da Amazon
2       2. Bill Gates  ...                                 dono da Microsoft
3   3. Warren Buffett  ...                                        investidor
4  4. Bernard Arnault  ...   presidente do grupo LVMH (Louis Vuitton e Sep...

[5 rows x 3 columns]

In [33]:
# iremos separar a coluna patrimony em 3 colunas distintas: uss, number e qtd 

patrimonio = df['patrimony'].str.split(' ')
df['uss'] = patrimonio.str.get(0)
df['number'] = patrimonio.str.get(1)
df['qtd'] = patrimonio.str.get(2)
df[:5]

                 name          patrimony  ... number       qtd
0               Nome         Patrimônio   ...    NaN       NaN
1       1. Jeff Bezos   US$ 131 bilhões   ...    131  bilhões
2       2. Bill Gates  US$ 96,5 bilhões   ...   96,5  bilhões
3   3. Warren Buffett  US$ 82,5 bilhões   ...   82,5  bilhões
4  4. Bernard Arnault    US$ 76 bilhões   ...     76  bilhões

[5 rows x 6 columns]

In [34]:
# excluindo a antiga coluna patrimony

df.drop('patrimony', axis = 1, inplace = True)

# excluindo a primeira linha

df.drop(0, inplace = True)
df[:5]

                 name  ...       qtd
1       1. Jeff Bezos  ...  bilhões
2       2. Bill Gates  ...  bilhões
3   3. Warren Buffett  ...  bilhões
4  4. Bernard Arnault  ...  bilhões
5      5. Carlos Slim  ...  bilhões

[5 rows x 5 columns]

In [35]:
# descobrindo o tipo de cada coluna

df.dtypes

name          object
employment    object
uss           object
number        object
qtd           object
dtype: object

In [36]:
# para trabalharmos com números temos que converter a coluna number dê object para float

df['number'] = df["number"].str.replace(',', ".").astype(float)
df[:5]

                 name  ...       qtd
1       1. Jeff Bezos  ...  bilhões
2       2. Bill Gates  ...  bilhões
3   3. Warren Buffett  ...  bilhões
4  4. Bernard Arnault  ...  bilhões
5      5. Carlos Slim  ...  bilhões

[5 rows x 5 columns]

In [37]:
# inserindo informações em uma variável

df_estatistico = round(df.describe(), 2)
df_estatistico

       number
count   20.00
mean    60.36
std     22.13
min     38.80
25%     48.12
50%     50.65
75%     63.03
max    131.00

In [42]:
from google.colab import drive
drive.mount('/gdrive')
%cd /gdrive

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /gdrive
/gdrive

In [0]:
# salvando informações
df.to_csv('/gdrive/My Drive/Colab Notebooks/Datasets/rich_20.csv')
df_estatistico.to_csv('/gdrive/My Drive/Colab Notebooks/Datasets/rich_20_estatistico.csv')